edwardtoday/photoframe/firmware/photoframe-fw/sdkconfig.defaults
# ESP-IDF base
CONFIG_IDF_TARGET="esp32s3"

# Flash / partition
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# PSRAM（用于 BMP 缓冲与墨水屏缓冲）
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MEMTEST=n
CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=8192
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536

# Wi-Fi / HTTP
CONFIG_ESP_WIFI_DYNAMIC_RX_BUFFER_NUM=16
CONFIG_ESP_WIFI_STATIC_RX_BUFFER_NUM=8
CONFIG_HTTPD_MAX_REQ_HDR_LEN=2048
CONFIG_HTTPD_MAX_URI_LEN=512

# 日志
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
# 使用系统时间戳；校时成功后日志会显示可读时间。
# CONFIG_LOG_TIMESTAMP_SOURCE_RTOS is not set
CONFIG_LOG_TIMESTAMP_SOURCE_SYSTEM=y
# 控制台输出走 USB Serial/JTAG：macOS 只接一根 USB 线即可烧录 + 抓日志。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
# 主控制台已是 USB Serial/JTAG，关闭 secondary console，避免重复输出与额外开销。
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# NVS
CONFIG_NVS_ENCRYPTION=n
# 主任务栈（HTTPS/TLS 与 JSON 解析会占用较多栈空间）
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_MAIN_TASK_STACK_SIZE=8192
